/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putnbr.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ezaynabi <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/07/21 14:32:14 by ezaynabi          #+#    #+#             */
/*   Updated: 2020/07/21 15:18:59 by ezaynabi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <unistd.h>

void	ft_putnbr(int nb)
{
	long int A;
	char c;

	A = nb;
	if (A < 0)//проверка отрицательных
	{
		write(1,"-",1);
		A *= -1;
	}
	if (A != 0)//проверка на не ноль
	{
		if (A / 10)
			ft_putnbr(A / 10);	//если число 10 и больше, то рекурсия продолжится
		c = '0' + (A % 10);
		write(1,&c,1);	//иначе мы уже в единичном разряде и пора выводит
	}
	else//если 0, выводим 0
		write(1, "0", 1);
}

int		main()
{
	ft_putnbr(-2147483648);
	return 0 ;
}
